Autodesk.Revit.DB.Architecture.RailingType.SecondaryHandrailType
The type of the secondary handrail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The handRailTypeId is not a valid hand rail type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandrailType
The type of the primary handrail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The handRailTypeId is not a valid hand rail type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Architecture.RailingType.TopRailType
The type of the top rail in the railing system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The topRailType is not a valid top rail type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013